<?php
return array
(
	'x1' => array(
	'not_empty'             => 'Извини, но тут не должно быть пусто',
    	'numeric'               => 'Брат, давай число, а то вычеслю по айпи!'
         ),
         
        'x2' => array(
	'not_empty'             => 'Извини, но тут не должно быть пусто',
    	'numeric'               => 'Брат, давай число, а то вычеслю по айпи!'
         ),
    
        'y1' => array(
	'not_empty'             => 'Извини, но тут не должно быть пусто',
    	'numeric'               => 'Брат, давай число, а то вычеслю по айпи!'
         ),
    
        'y2' => array(
	'not_empty'             => 'Извини, но тут не должно быть пусто',
    	'numeric'               => 'Брат, давай число, а то вычеслю по айпи!'
         ),
    
        'h' => array(
	'not_empty'             => 'Извини, но тут не должно быть пусто',
    	'numeric'               => 'Брат, давай число, а то вычеслю по айпи!'
         ),
    
        'g' => array(
	'not_empty'             => 'Извини, но тут не должно быть пусто',
    	'numeric'               => 'Брат, давай число, а то вычеслю по айпи!'
         ),
    
        'r' => array(
	'not_empty'             => 'Извини, но тут не должно быть пусто',
    	'numeric'               => 'Брат, давай число, а то вычеслю по айпи!',
        'range'                => 'Ну ти шо от 1 до 4'
         ),
);
?>
